# CAO Points Notebook 

*** 

The first section within this notebook will load the CAO point for the years 2021, 2020, & 2019 and provide a clear and concise overview of how to do so.

***

## Loading the data

In [1]:
# Convenient HTTP requests
import requests as rq
# Importing regular expressions
import re
import datetime as dt
import pandas as pd
import urllib.request as urlrq
import matplotlib.pyplot as plt

In [2]:
#current date and time.
now = dt.datetime.now()

# Format the above as a string.
nowstr = now.strftime('%Y%m%d_%H%M%S')

## 2021 Data

In [3]:
# First need to use 'requests' to pull the 2021
resp = rq.get('http://www2.cao.ie/points/l8.php')

# check
resp

### Saving the original data set 

***

In [4]:
pathhtml = 'data/cao2021' +  nowstr + '.html'

In [5]:
# the server uses the wrong encoding, fixing it.

original_encoding = resp.encoding
#changing it to cp1252

resp.encoding = 'cp1252'

# save the original file

with open(pathhtml, 'w') as f:
    f.write(resp.text)

### Using regular expression

In [6]:
#compile regular expression for matching lines. 
# this will make the code below more efficient 
re_course = re.compile(r'([A-Z]{2}[0-9]{3})(.*)')

In [7]:
path2021 = 'data/cao2021' +  nowstr + '.csv'    

no_lines = 0 
#looping through the lines of the response content.
# Open the csv file for writing.
with open(path2021, 'w') as f:
    # Writing the header.
    f.write(','.join(['Course code', 'Course title', 'Round 1 Points', 'Round 2 Points']) + '\n')
    # Looping through the lines
    for line in resp.iter_lines():
        # Decode the line, using the wrong encoding!
        dline = line.decode('cp1252')
        # Match only the lines representing courses.
        if re_course.fullmatch(dline):
            # Add one to the lines counter.
            no_lines = no_lines + 1
            # course code.
            course_code = dline[:5]
            # course title.
            course_title = dline[7:57].strip()
            # Round one points.
            course_points = re.split(' +', dline[60:])
            if len(course_points) != 2:
                course_points = course_points[:2]
            # Join the fields using a comma.
            linesplit = [course_code, course_title, course_points[0], course_points[1]]
            #print(len(linesplit), linesplit, dline)
            # Rejoin the substrings with commas in between.
            f.write(','.join(linesplit) + '\n')
print(f"The total number of lines is {no_lines}.")

The total number of lines is 949.

In [8]:
df2021 = pd.read_csv(path2021, encoding='cp1252')

In [9]:
df2021

,Course code,Course title,Round 1 Points,Round 2 Points
0,AL801,Software Design for Virtual Reality and Gaming,300,NaN
1,AL802,Software Design in Artificial Intelligence for...,313,NaN
2,AL803,Software Design for Mobile Apps and Connected ...,350,NaN
3,AL805,Computer Engineering for Network Infrastructure,321,NaN
4,AL810,Quantity Surveying,328,NaN
...,...,...,...,...
944,WD211,Creative Computing,270,NaN
945,WD212,Recreation and Sport Management,262,NaN
946,WD230,Mechanical and Manufacturing Engineering,230,230
947,WD231,Early Childhood Care and Education,266,NaN
948,WD232,Business Information Systems,261,261

<br>

## 2020 Points

### Saving original file

In [10]:
path = 'data/original_cao2020_' +  nowstr + '.xlsx'

In [11]:
urlrq.urlretrieve('http://www2.cao.ie/points/CAOPointsCharts2020.xlsx', path)

('data/original_cao2020_20211211_131521.xlsx',
 <http.client.HTTPMessage at 0x2344130b730>)

In [12]:
# download and parse the excel spreadsheet
#skiprow to skip the first 10 rows
df2020 = pd.read_excel('http://www2.cao.ie/points/CAOPointsCharts2020.xlsx', skiprows=10)

In [13]:
df2020

,CATEGORY (i.e.ISCED description),COURSE TITLE,COURSE CODE2,R1 POINTS,R1 Random *,R2 POINTS,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1459,Manufacturing and processing,Manufacturing Engineering,WD208,188,NaN,NaN,NaN,188,NaN,339,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1460,Information and Communication Technologies (ICTs),Software Systems Development,WD210,279,NaN,NaN,NaN,279,NaN,337,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1461,Information and Communication Technologies (ICTs),Creative Computing,WD211,271,NaN,NaN,NaN,271,NaN,318,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1462,Personal services,Recreation and Sport Management,WD212,270,NaN,NaN,NaN,270,NaN,349,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1463,Engineering and engineering trades,Mechanical and Manufacturing Engineering,WD230,253,NaN,NaN,NaN,253,NaN,369,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
#spotchecks with dataset 
df2020.iloc[754]

CATEGORY (i.e.ISCED description)    Engineering and engineering trades
COURSE TITLE                                    Mechanical Engineering
COURSE CODE2                                                     LC288
R1 POINTS                                                          347
R1 Random *                                                        NaN
R2 POINTS                                                          346
R2 Random*                                                         NaN
EOS                                                                346
EOS Random *                                                       NaN
EOS Mid-point                                                      415
LEVEL                                                                8
HEI                                   Limerick Institute of Technology
Test/Interview #                                                   NaN
avp                                                                NaN
v                                                                  NaN
Column1                                                            NaN
Column2                                                            NaN
Column3                                                            NaN
Column4                                                            NaN
Column5                                                            NaN
Column6                                                            NaN
Column7                                                            NaN
Column8                                                            NaN
Name: 754, dtype: object

In [15]:
df2020.iloc[1463]

CATEGORY (i.e.ISCED description)          Engineering and engineering trades
COURSE TITLE                        Mechanical and Manufacturing Engineering
COURSE CODE2                                                           WD230
R1 POINTS                                                                253
R1 Random *                                                              NaN
R2 POINTS                                                                NaN
R2 Random*                                                               NaN
EOS                                                                      253
EOS Random *                                                             NaN
EOS Mid-point                                                            369
LEVEL                                                                      8
HEI                                        Waterford Institute of Technology
Test/Interview #                                                         NaN
avp                                                                      NaN
v                                                                        NaN
Column1                                                                  NaN
Column2                                                                  NaN
Column3                                                                  NaN
Column4                                                                  NaN
Column5                                                                  NaN
Column6                                                                  NaN
Column7                                                                  NaN
Column8                                                                  NaN
Name: 1463, dtype: object

In [16]:
# creating a file path for the pandas data
path = 'data/original_cao2020_' +  nowstr + '.csv'

In [17]:
df2020.to_csv(path)   #saving pandas to disk

***
## 2019 Points

#### Steps to reproduce 

- look up truncate?

1. Download origanl pdf.
2. Open pdf in word.
3. Save word word's converted pdf as docx file.
4. Re save word doc for editing.
5. delete headers and footers
6. Delete preamble
7. select all and copy
8. paste into Notepad ++
9. Remove HEI name headings and paste onto each course line
10. Delte blank lines
11. replace duouble tab characters with single characters 
12. change backticks to apostrophes

In [18]:
df2019 = pd.read_csv('data/cao2019_2311.csv', sep= '\t', usecols = [1,2,3,4])

In [19]:
df2019

      Code                                             COURSE  EOS    Mid
0    AL801    Software Design with Virtual Reality and Gaming  304  328.0
1    AL802               Software Design with Cloud Computing  301  306.0
2    AL803  Software Design with Mobile Apps and Connected...  309  337.0
3    AL805        Network Management and Cloud Infrastructure  329  442.0
4    AL810                                 Quantity Surveying  307  349.0
..     ...                                                ...  ...    ...
923  WD200                                     Arts (options)  221  296.0
924  WD210                       Software Systems Development  271  329.0
925  WD211                                 Creative Computing  275  322.0
926  WD212                    Recreation and Sport Management  274  311.0
927  WD230           Mechanical and Manufacturing Engineering  273  348.0

[928 rows x 4 columns]

<br> 

## Concat and join

In [20]:
courses2021 = df2021[['Course code', 'Course title']]
courses2021

    Course code                                       Course title
0         AL801     Software Design for Virtual Reality and Gaming
1         AL802  Software Design in Artificial Intelligence for...
2         AL803  Software Design for Mobile Apps and Connected ...
3         AL805    Computer Engineering for Network Infrastructure
4         AL810                                 Quantity Surveying
..          ...                                                ...
944       WD211                                 Creative Computing
945       WD212                    Recreation and Sport Management
946       WD230           Mechanical and Manufacturing Engineering
947       WD231                 Early Childhood Care and Education
948       WD232                       Business Information Systems

[949 rows x 2 columns]

In [21]:
courses2020 = df2020[['COURSE CODE2', 'COURSE TITLE']]
courses2020.columns = ['Course code', 'Course title']
courses2020

     Course code                                       Course title
0          AC120                             International Business
1          AC137                                       Liberal Arts
2          AD101   First Year Art & Design (Common Entry,portfolio)
3          AD102  Graphic Design and Moving Image Design (portfo...
4          AD103  Textile & Surface Design and Jewellery & Objec...
...          ...                                                ...
1459       WD208                          Manufacturing Engineering
1460       WD210                       Software Systems Development
1461       WD211                                 Creative Computing
1462       WD212                    Recreation and Sport Management
1463       WD230           Mechanical and Manufacturing Engineering

[1464 rows x 2 columns]

In [22]:
courses2019 = df2019[['Code','COURSE']]
courses2019.columns = ['Course code', 'Course title']
courses2019

    Course code                                       Course title
0         AL801    Software Design with Virtual Reality and Gaming
1         AL802               Software Design with Cloud Computing
2         AL803  Software Design with Mobile Apps and Connected...
3         AL805        Network Management and Cloud Infrastructure
4         AL810                                 Quantity Surveying
..          ...                                                ...
923       WD200                                     Arts (options)
924       WD210                       Software Systems Development
925       WD211                                 Creative Computing
926       WD212                    Recreation and Sport Management
927       WD230           Mechanical and Manufacturing Engineering

[928 rows x 2 columns]

In [23]:
allcourses = pd.concat([courses2021, courses2020, courses2019], ignore_index =True)
allcourses

     Course code                                       Course title
0          AL801     Software Design for Virtual Reality and Gaming
1          AL802  Software Design in Artificial Intelligence for...
2          AL803  Software Design for Mobile Apps and Connected ...
3          AL805    Computer Engineering for Network Infrastructure
4          AL810                                 Quantity Surveying
...          ...                                                ...
3336       WD200                                     Arts (options)
3337       WD210                       Software Systems Development
3338       WD211                                 Creative Computing
3339       WD212                    Recreation and Sport Management
3340       WD230           Mechanical and Manufacturing Engineering

[3341 rows x 2 columns]

In [24]:
allcourses.sort_values('Course code')

     Course code                              Course title
175        AC120                    International Business
949        AC120                    International Business
2581       AC120                    International Business
950        AC137                              Liberal Arts
2582       AC137                              Liberal Arts
...          ...                                       ...
946        WD230  Mechanical and Manufacturing Engineering
2412       WD230  Mechanical and Manufacturing Engineering
3340       WD230  Mechanical and Manufacturing Engineering
947        WD231        Early Childhood Care and Education
948        WD232              Business Information Systems

[3341 rows x 2 columns]

In [25]:
allcourses.loc[175]['Course title']

'International Business'

In [26]:
allcourses.loc[949]['Course title']

'International Business'

In [27]:
allcourses.loc[2581]['Course title']

'International Business'

In [28]:
#finding all copies of duplicated rows.
allcourses[allcourses.duplicated(subset=['Course code'])]

     Course code                                       Course title
949        AC120                             International Business
950        AC137                                       Liberal Arts
951        AD101   First Year Art & Design (Common Entry,portfolio)
952        AD102  Graphic Design and Moving Image Design (portfo...
953        AD103  Textile & Surface Design and Jewellery & Objec...
...          ...                                                ...
3336       WD200                                     Arts (options)
3337       WD210                       Software Systems Development
3338       WD211                                 Creative Computing
3339       WD212                    Recreation and Sport Management
3340       WD230           Mechanical and Manufacturing Engineering

[1658 rows x 2 columns]

In [29]:
#returns copy of data with duplicates removed
allcourses.drop_duplicates(subset=['Course code'], inplace=True, ignore_index=True)

In [30]:
allcourses

     Course code                                       Course title
0          AL801     Software Design for Virtual Reality and Gaming
1          AL802  Software Design in Artificial Intelligence for...
2          AL803  Software Design for Mobile Apps and Connected ...
3          AL805    Computer Engineering for Network Infrastructure
4          AL810                                 Quantity Surveying
...          ...                                                ...
1678       SG441                              Environmental Science
1679       SG446                                Applied Archaeology
1680       TL803                                   Music Technology
1681       TL812                       Computing with Digital Media
1682       WD148                                  Tourism Marketing

[1683 rows x 2 columns]

<br>

## Joing to the points

In [31]:
#Set index to course code
df2021.set_index('Course code', inplace =True)
df2021.columns = ['Course title','Round 1 Points 2021','Round 2 Points 2021']
df2021

,Course title,Round 1 Points 2021,Round 2 Points 2021
Course code,,,
AL801,Software Design for Virtual Reality and Gaming,300,NaN
AL802,Software Design in Artificial Intelligence for...,313,NaN
AL803,Software Design for Mobile Apps and Connected ...,350,NaN
AL805,Computer Engineering for Network Infrastructure,321,NaN
AL810,Quantity Surveying,328,NaN
...,...,...,...
WD211,Creative Computing,270,NaN
WD212,Recreation and Sport Management,262,NaN
WD230,Mechanical and Manufacturing Engineering,230,230
WD231,Early Childhood Care and Education,266,NaN
WD232,Business Information Systems,261,261

In [32]:
allcourses.set_index('Course code', inplace=True)

In [34]:
allcourses = allcourses.join(df2021[['Round 1 Points 2021']])
allcourses

,Course title,Round 1 Points 2021
Course code,,
AL801,Software Design for Virtual Reality and Gaming,300
AL802,Software Design in Artificial Intelligence for...,313
AL803,Software Design for Mobile Apps and Connected ...,350
AL805,Computer Engineering for Network Infrastructure,321
AL810,Quantity Surveying,328
...,...,...
SG441,Environmental Science,NaN
SG446,Applied Archaeology,NaN
TL803,Music Technology,NaN
TL812,Computing with Digital Media,NaN
WD148,Tourism Marketing,NaN

In [35]:
df2020_r1 = df2020[['COURSE CODE2', 'R1 POINTS']]
df2020_r1.columns = ['Course code', 'Round 1 Points 2020']
df2020_r1

     Course code Round 1 Points 2020
0          AC120                 209
1          AC137                 252
2          AD101            #+matric
3          AD102            #+matric
4          AD103            #+matric
...          ...                 ...
1459       WD208                 188
1460       WD210                 279
1461       WD211                 271
1462       WD212                 270
1463       WD230                 253

[1464 rows x 2 columns]

In [36]:
#Set index to course code
df2020_r1.set_index('Course code', inplace =True)
df2020_r1

            Round 1 Points 2020
Course code
AC120                       209
AC137                       252
AD101                  #+matric
AD102                  #+matric
AD103                  #+matric
...                         ...
WD208                       188
WD210                       279
WD211                       271
WD212                       270
WD230                       253

[1464 rows x 1 columns]

In [37]:
# Join 2020 points to allcourses
allcourses = allcourses.join(df2020_r1)
allcourses

,Course title,Round 1 Points 2021,Round 1 Points 2020
Course code,,,
AL801,Software Design for Virtual Reality and Gaming,300,303
AL802,Software Design in Artificial Intelligence for...,313,332
AL803,Software Design for Mobile Apps and Connected ...,350,337
AL805,Computer Engineering for Network Infrastructure,321,333
AL810,Quantity Surveying,328,319
...,...,...,...
SG441,Environmental Science,NaN,NaN
SG446,Applied Archaeology,NaN,NaN
TL803,Music Technology,NaN,NaN
TL812,Computing with Digital Media,NaN,NaN
WD148,Tourism Marketing,NaN,NaN

In [39]:
df2019_r1 = df2019[['Code', 'EOS']]
df2019_r1.columns = ['Course code', 'Round 1 Points 2019']
df2019_r1

    Course code Round 1 Points 2019
0         AL801                 304
1         AL802                 301
2         AL803                 309
3         AL805                 329
4         AL810                 307
..          ...                 ...
923       WD200                 221
924       WD210                 271
925       WD211                 275
926       WD212                 274
927       WD230                 273

[928 rows x 2 columns]

In [40]:
#Set index to course code
df2019_r1.set_index('Course code', inplace =True)
df2019_r1

            Round 1 Points 2019
Course code
AL801                       304
AL802                       301
AL803                       309
AL805                       329
AL810                       307
...                         ...
WD200                       221
WD210                       271
WD211                       275
WD212                       274
WD230                       273

[928 rows x 1 columns]

In [41]:
# Join 2019 points to allcourses
allcourses = allcourses.join(df2019_r1)
allcourses

,Course title,Round 1 Points 2021,Round 1 Points 2020,Round 1 Points 2019
Course code,,,,
AL801,Software Design for Virtual Reality and Gaming,300,303,304
AL802,Software Design in Artificial Intelligence for...,313,332,301
AL803,Software Design for Mobile Apps and Connected ...,350,337,309
AL805,Computer Engineering for Network Infrastructure,321,333,329
AL810,Quantity Surveying,328,319,307
...,...,...,...,...
SG441,Environmental Science,NaN,NaN,297
SG446,Applied Archaeology,NaN,NaN,289
TL803,Music Technology,NaN,NaN,264
TL812,Computing with Digital Media,NaN,NaN,369
WD148,Tourism Marketing,NaN,NaN,269